In [2]:
import pandas as pd

In [39]:
data = {
    'Name':['Angela', 'Daniel', 'Marco', 'Marco', 'Angela'],
    'Age': [25, 33, 30, 32, 31],
}

In [33]:
data

{'Name': ['Angela', 'Daniel', 'Daniel', 'Marco', 'Marco', 'Angela'],
 'Age': [25, 33, 33, 30, 32, 31]}

In [40]:
df = pd.DataFrame(data)

In [41]:
df['Salary'] = [50000, 60000, 70000, 10000, 30000]

In [42]:
df

     Name  Age  Salary
0  Angela   25   50000
1  Daniel   33   60000
2   Marco   30   70000
3   Marco   32   10000
4  Angela   31   30000